import { IRiaCategories } from "../models/Interfaces";
/* tslint:disable trailing-comma */
/* tslint:disable object-literal-key-quotes */
export const bodyStyles: IRiaCategories[] = [
    {
        "name": "Седан",
        "value": 3
    },
    {
        "name": "Внедорожник / Кроссовер",
        "value": 5
    },
    {
        "name": "Минивэн",
        "value": 8
    },
    {
        "name": "Хэтчбек",
        "value": 4
    },
    {
        "name": "Универсал",
        "value": 2
    },
    {
        "name": "Купе",
        "value": 6
    },
    {
        "name": "Легковой фургон (до 1,5 т)",
        "value": 254
    },
    {
        "name": "Кабриолет",
        "value": 7
    },
    {
        "name": "Пикап",
        "value": 9
    },
    {
        "name": "Лифтбек",
        "value": 307
    },
    {
        "name": "Лимузин",
        "value": 252
    },
    {
        "name": "Другой",
        "value": 28
    },
    {
        "name": "Родстер",
        "value": 315
    },
    {
        "name": "Вездеход-амфибия",
        "value": 43
    },
    {
        "name": "Гольф-кар",
        "value": 44
    },
    {
        "name": "Другое",
        "value": 56
    },
    {
        "name": "Картинг",
        "value": 45
    },
    {
        "name": "Квадроцикл  утилитарный",
        "value": 41
    },
    {
        "name": "Квадроцикл детский",
        "value": 36
    },
    {
        "name": "Квадроцикл спортивный",
        "value": 39
    },
    {
        "name": "Квадроциклы",
        "value": 35
    },
    {
        "name": "Макси-скутер",
        "value": 12
    },
    {
        "name": "Мини крос (Питбайк)",
        "value": 33
    },
    {
        "name": "Мини мотоциклы",
        "value": 31
    },
    {
        "name": "Мини спорт",
        "value": 32
    },
    {
        "name": "Мопеды",
        "value": 58
    },
    {
        "name": "Мотовездеход",
        "value": 42
    },
    {
        "name": "Мотоцикл Без обтекателей (Naked bike)",
        "value": 15
    },
    {
        "name": "Мотоцикл Внедорожный (Enduro)",
        "value": 21
    },
    {
        "name": "Мотоцикл Кастом",
        "value": 30
    },
    {
        "name": "Мотоцикл Классик",
        "value": 14
    },
    {
        "name": "Мотоцикл Кросс",
        "value": 19
    },
    {
        "name": "Мотоцикл Круизер",
        "value": 24
    },
    {
        "name": "Мотоцикл Многоцелевой (All-round)",
        "value": 25
    },
    {
        "name": "Мотоцикл с коляской",
        "value": 29
    },
    {
        "name": "Мотоцикл Спорт-туризм",
        "value": 17
    },
    {
        "name": "Мотоцикл Супермото (Motard)",
        "value": 22
    },
    {
        "name": "Мотоцикл Триал",
        "value": 20
    },
    {
        "name": "Мотоцикл Туризм",
        "value": 16
    },
    {
        "name": "Мотоцикл Чоппер",
        "value": 23
    },
    {
        "name": "Мотоциклы",
        "value": 13
    },
    {
        "name": "Скутер / Мотороллер",
        "value": 11
    },
    {
        "name": "Снегоход",
        "value": 46
    },
    {
        "name": "Спортбайк",
        "value": 18
    },
    {
        "name": "Трайк",
        "value": 57
    },
    {
        "name": "Трицикл",
        "value": 34
    },
    {
        "name": "Автовоз",
        "value": 178
    },
    {
        "name": "Бетономешалка (Миксер) полуприцеп",
        "value": 172
    },
    {
        "name": "Борт",
        "value": 150
    },
    {
        "name": "Бортовой полуприцеп",
        "value": 165
    },
    {
        "name": "Для перевозки животных - полуприцеп",
        "value": 176
    },
    {
        "name": "Для перевозки животных - прицеп",
        "value": 159
    },
    {
        "name": "Другое",
        "value": 251
    },
    {
        "name": "Зерновоз - полуприцеп",
        "value": 387
    },
    {
        "name": "Зерновоз - прицеп",
        "value": 386
    },
    {
        "name": "Изотермическая будка",
        "value": 303
    },
    {
        "name": "Контейнеровоз",
        "value": 154
    },
    {
        "name": "Контейнеровоз полуприцеп",
        "value": 169
    },
    {
        "name": "Лафет",
        "value": 256
    },
    {
        "name": "Легковой прицеп",
        "value": 179
    },
    {
        "name": "Лесовоз / Сортиментовоз - полуприцеп",
        "value": 175
    },
    {
        "name": "Лесовоз / Сортиментовоз - прицеп",
        "value": 160
    },
    {
        "name": "Низкорамная платформа",
        "value": 164
    },
    {
        "name": "Платформа",
        "value": 149
    },
    {
        "name": "Платформа полуприцеп",
        "value": 163
    },
    {
        "name": "Плитовоз",
        "value": 177
    },
    {
        "name": "Полуприцеп",
        "value": 161
    },
    {
        "name": "Прицеп",
        "value": 147
    },
    {
        "name": "Прицеп дача",
        "value": 255
    },
    {
        "name": "Рефрижератор",
        "value": 157
    },
    {
        "name": "Рефрижератор полуприцеп",
        "value": 173
    },
    {
        "name": "Самосвал полуприцеп",
        "value": 168
    },
    {
        "name": "Самосвал прицеп",
        "value": 152
    },
    {
        "name": "Тентованный борт (штора) - полуприцеп",
        "value": 167
    },
    {
        "name": "Тентованный борт (штора) - прицеп",
        "value": 151
    },
    {
        "name": "Фургон",
        "value": 153
    },
    {
        "name": "Фургон полуприцеп",
        "value": 170
    },
    {
        "name": "Цистерна",
        "value": 155
    },
    {
        "name": "Цистерна полуприцеп",
        "value": 171
    },
    {
        "name": "Шасси",
        "value": 148
    },
    {
        "name": "Шасси полуприцеп",
        "value": 162
    },
    {
        "name": "Автовоз",
        "value": 207
    },
    {
        "name": "Бортовой",
        "value": 194
    },
    {
        "name": "Вахтовый автобус / Кунг",
        "value": 228
    },
    {
        "name": "Грузовик",
        "value": 190
    },
    {
        "name": "Для перевозки животных",
        "value": 203
    },
    {
        "name": "Другое",
        "value": 213
    },
    {
        "name": "Зерновоз",
        "value": 385
    },
    {
        "name": "Контейнеровоз",
        "value": 200
    },
    {
        "name": "Кормовоз",
        "value": 314
    },
    {
        "name": "Легковой фургон (до 1,5 т)",
        "value": 254
    },
    {
        "name": "Лесовоз / Сортиментовоз",
        "value": 204
    },
    {
        "name": "Микроавтобус грузовой (до 3,5т)",
        "value": 210
    },
    {
        "name": "Мультилифт",
        "value": 205
    },
    {
        "name": "Мусоровоз",
        "value": 211
    },
    {
        "name": "Платформа",
        "value": 193
    },
    {
        "name": "Рефрижератор",
        "value": 198
    },
    {
        "name": "Самосвал",
        "value": 196
    },
    {
        "name": "Стекловоз",
        "value": 206
    },
    {
        "name": "Тентованый",
        "value": 195
    },
    {
        "name": "Тягач",
        "value": 212
    },
    {
        "name": "Фургон",
        "value": 197
    },
    {
        "name": "Цистерна",
        "value": 201
    },
    {
        "name": "Шасси",
        "value": 192
    },
    {
        "name": "Эвакуатор",
        "value": 208
    },
    {
        "name": "Автобус",
        "value": 220
    },
    {
        "name": "Городской автобус",
        "value": 221
    },
    {
        "name": "Другое",
        "value": 229
    },
    {
        "name": "Микроавтобус (от 10 до 22 пас.)",
        "value": 219
    },
    {
        "name": "Пригородный автобус",
        "value": 224
    },
    {
        "name": "Туристический / Междугородний автобус",
        "value": 227
    }
];
